Портал_EDT/src/DataProcessors/Аук_РабочийСтолАукционы/Аук_РабочийСтолАукционы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Аук_РабочийСтолАукционы</name>
</mdclass:DataProcessor>

Портал_EDT/src/InformationRegisters/Аук_ИсторияДанныхАукционов/Аук_ИсторияДанныхАукционов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Аук_ИсторияДанныхАукционов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ЗначениеЭлементаДанных</name>
    <type>
      <types>Characteristic.Аук_ЭлементыДанныхАукционов</types>
    </type>
  </resources>
  <attributes>
    <name>НаправлениеДанных</name>
    <type>
      <types>EnumRef.Аук_НаправленияДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДанных</name>
    <type>
      <types>EnumRef.Аук_ВидыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.Аук_КонтактныеЛицаУчастниковАукционов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЭтапа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Аукцион</name>
    <type>
      <types>CatalogRef.Аук_Аукционы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Аук_УчастникиАукционов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтрокаДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементДанных</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.Аук_ЭлементыДанныхАукционов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Портал_EDT/src/Catalogs/Аук_Аукционы/Аук_Аукционы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Аук_Аукционы</name>
  <attributes>
    <name>ВидАукциона</name>
    <type>
      <types>CatalogRef.Аук_ВидыАукционов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Срок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.УБД_Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторИзменения</name>
    <type>
      <types>CatalogRef.УБД_Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийАукцион</name>
    <type>
      <types>CatalogRef.Аук_Аукционы</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическийСтарт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическийПереходПоЭтапам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическоеПодведениеПромежуточныхИтогов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическоеПодведениеОкончательныхИтогов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрЛицо</name>
    <type>
      <types>CatalogRef.УБД_ЮрЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Участники</name>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Аук_УчастникиАукционов</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.Аук_КонтактныеЛицаУчастниковАукционов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НачальныеДанные</name>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Аук_УчастникиАукционов</types>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаНачальныхДанных</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭлементНачальныхДанных</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.Аук_ЭлементыДанныхАукционов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеНачальныхДанных</name>
      <type>
        <types>Characteristic.Аук_ЭлементыДанныхАукционов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Этапы</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлительностьДни</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлительностьЧасы</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Портал_EDT/src/DataProcessors/Аук_РабочийСтолАукционы/Forms/ПросмотрИсторииСтавок2/Module.bsl
//////////////////////////////////////////////////////////////
// Условное оформление задано программно,
// даже то что можно было бы задать через настройки формы
//

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НачальнаяИнициализация();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКоманд

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НачальнаяИнициализация()
	
	ЭтотОбъект.Аукцион		= Параметры.Аукцион;
	ЭтотОбъект.ВидАукциона	= Параметры.ВидАукциона;
	
	//Аук_ОбщийСервер.ДобавитьКолонкиДанныхСтавкиПоВидуАукциона(ЭтотОбъект, Параметры.ВидАукциона, "тзИсторияСтавок",,, Ложь); 
	
	Аук_ОбщийСервер.ДобавитьКолонкиДанныхСтавкиПоВидуАукциона(ЭтотОбъект, Параметры.ВидАукциона, "дзИсторияСтавок", Элементы.дзИсторияСтавокГруппа3,, Ложь);
	
	ЗаполнитьИсториюСтавок();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсториюСтавок()
		
	//тзВсеСтавки = РегистрыСведений.Аук_ИсторияДанныхАукционов.ПолнаяИсторияСтавокУчастниковАукционаВСтроке(Параметры.Аукцион, Параметры.ВидАукциона);
	//
	//тзТемп = РеквизитФормыВЗначение("тзИсторияСтавок");
	//
	//Для Каждого СтрокаТз Из тзВсеСтавки Цикл
	//	
	//	НовСтрока = тзТемп.Добавить();
	//	
	//	ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТз);
	//	
	//КонецЦикла;
	//
	//ЗначениеВРеквизитФормы(тзТемп, "тзИсторияСтавок");
	
	///////////////////
	масЭтапыАукциона = Справочники.Аук_Аукционы.ЭтапыАукциона(Параметры.Аукцион);
	
	тзВсеСтавки1 = РегистрыСведений.Аук_ИсторияДанныхАукционов.ПолнаяИсторияСтавокУчастниковАукционаПоЭтапамВСтроке(Параметры.Аукцион, Параметры.ВидАукциона);
	
	дзТемп = РеквизитФормыВЗначение("дзИсторияСтавок");
	
	Для Каждого сткЭлЭтап Из масЭтапыАукциона Цикл
		
		масСтрокиТз = тзВсеСтавки1.НайтиСтроки(Новый Структура("Этап", сткЭлЭтап.Этап));
		
		Если масСтрокиТз.Количество() <> 0 Тогда
			
			НовСтрокаГр1 = дзТемп.Строки.Добавить();
			
			НовСтрокаГр1.Этап = сткЭлЭтап.Этап;
			
			Для Каждого СтрокаТз Из масСтрокиТз Цикл
				
				ЗаполнитьЗначенияСвойств(НовСтрокаГр1.Строки.Добавить(), СтрокаТз);
				
			КонецЦикла;	
			
		КонецЕсли;	
		
	КонецЦикла;	
		
	ЗначениеВРеквизитФормы(дзТемп, "дзИсторияСтавок");
	
	/////////////////// УО	
	масПоля = Аук_ОбщийСервер.СписокПодчиненныхПолейВводаЭлементаФормы(Элементы.дзИсторияСтавокГруппа1);
	
	УсловноеОформление.Элементы.Очистить(); 
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ОбщегоНазначения.УстановитьЗначенияПараметровУсловногоОформления(ЭлементОформления, Новый Структура("Видимость", Истина));	
	ОбщегоНазначения.ДобавитьЭлементОтбораУсловногоОформления(ЭлементОформления, "дзИсторияСтавок.Период", "Заполнено");
	ОбщегоНазначения.ДобавитьПолеУсловногоОформления(ЭлементОформления, СтрСоединить(масПоля, ", "));
		
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ОбщегоНазначения.УстановитьЗначенияПараметровУсловногоОформления(ЭлементОформления, Новый Структура("Видимость", Ложь));	
	ОбщегоНазначения.ДобавитьЭлементОтбораУсловногоОформления(ЭлементОформления, "дзИсторияСтавок.Период", "НеЗаполнено");
	ОбщегоНазначения.ДобавитьПолеУсловногоОформления(ЭлементОформления, СтрСоединить(масПоля, ", "));
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ОбщегоНазначения.УстановитьЗначенияПараметровУсловногоОформления(ЭлементОформления, Новый Структура("Видимость", Ложь));	
	ОбщегоНазначения.ДобавитьЭлементОтбораУсловногоОформления(ЭлементОформления, "дзИсторияСтавок.Период", "Заполнено");			
	ОбщегоНазначения.ДобавитьПолеУсловногоОформления(ЭлементОформления, "дзИсторияСтавокЭтап");
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ОбщегоНазначения.УстановитьЗначенияПараметровУсловногоОформления(ЭлементОформления, Новый Структура("Видимость", Истина));	
	ОбщегоНазначения.ДобавитьЭлементОтбораУсловногоОформления(ЭлементОформления, "дзИсторияСтавок.Период", "НеЗаполнено");			
	ОбщегоНазначения.ДобавитьПолеУсловногоОформления(ЭлементОформления, "дзИсторияСтавокЭтап");
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ОбщегоНазначения.УстановитьЗначенияПараметровУсловногоОформления(ЭлементОформления, Новый Структура("ЦветФона", WebЦвета.ХакиТемный));	
	ОбщегоНазначения.ДобавитьЭлементОтбораУсловногоОформления(ЭлементОформления, "дзИсторияСтавок.Период", "НеЗаполнено");			
	ОбщегоНазначения.ДобавитьПолеУсловногоОформления(ЭлементОформления, "дзИсторияСтавокЭтап");
	
	
КонецПроцедуры

#КонецОбласти
